src/xiaofang.Dispatch-Send-Message-Request.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:ns="urn:xiaofang">
 <SOAP-ENV:Body  SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <ns:Dispatch-Send-Message-Request>
   <id>0</id>
   <message>
    <id>0</id>
    <sender></sender>
    <text></text>
    <picture-uri></picture-uri>
    <audio-uri></audio-uri>
    <audio-length>0</audio-length>
    <video-uri></video-uri>
    <video-length>0</video-length>
    <timestamp></timestamp>
   </message>
  </ns:Dispatch-Send-Message-Request>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
